[
    {
      "id": 1,
      "name": "Amit Kumar",
      "budget": 5000,
      "image": "userimage/man.jpg",
      "about": "Amit Kumar is a 32-year-old software engineer from Bangalore, India. Passionate about technology and artificial intelligence, Amit enjoys solving complex problems and developing innovative software solutions. In his free time, he loves to read about new tech trends, work on personal projects, and contribute to open-source communities. Amit is also a fitness enthusiast who likes to run marathons and practice yoga. His calm and focused demeanor makes him an excellent team player. When not working, he enjoys traveling to hill stations, experimenting with local cuisine, and exploring historical sites.",
      "habits": ["Coding", "Running", "Yoga"],
      "age": 32,
      "occupation": "Software Engineer",
      "place": "Bangalore",
      "contact_no": "9845-123-456",
      "email": "amit.kumar@example.com",
      "instagram": "amit_coder",
      "linkedin": "amit-kumar",
      "gender": "Male",
      "preferred_gender": "female"
    },
    {
      "id": 2,
      "name": "Neha Sharma",
      "budget": 3000,
      "image": "userimage/woman1.jpg",
      "about": "Neha Sharma, a 27-year-old interior designer from Delhi, has a passion for creating beautiful, functional spaces. With a keen eye for detail, she works on both residential and commercial projects, transforming spaces with her artistic flair. Outside of her profession, Neha is a dedicated yoga practitioner and enjoys taking part in community wellness events. She also loves cooking traditional Indian dishes and experimenting with modern fusion cuisine. Neha is a self-proclaimed bookworm who enjoys curling up with a good novel during her free time. She hopes to start her own interior design firm one day.",
      "habits": ["Interior Design", "Yoga", "Cooking"],
      "age": 27,
      "occupation": "Interior Designer",
      "place": "Delhi",
      "contact_no": "9810-987-654",
      "email": "neha.sharma@example.com",
      "instagram": "neha_lifestyle",
      "linkedin": "neha-sharma",
      "gender": "Female",
      "preferred_gender": "male"
    },
    {
      "id": 3,
      "name": "Rohan Verma",
      "budget": 4500,
      "image": "userimage/man2.jpg",
      "about": "Rohan Verma, 29, is a digital marketer from Mumbai who specializes in helping small businesses grow their online presence. With over 7 years of experience in SEO and social media marketing, Rohan has worked with a variety of brands across different industries. He is passionate about data-driven strategies and stays up-to-date with the latest trends in digital marketing. Outside of work, Rohan enjoys playing the guitar and is part of a local band. He is also a fitness enthusiast and loves exploring new hiking trails in his spare time.",
      "habits": ["Guitar", "Fitness", "Hiking"],
      "age": 29,
      "occupation": "Digital Marketer",
      "place": "Mumbai",
      "contact_no": "9923-555-432",
      "email": "rohan.verma@example.com",
      "instagram": "rohan_rocks",
      "linkedin": "rohan-verma",
      "gender": "Male",
      "preferred_gender": "female"
    },
    {
      "id": 4,
      "name": "Priya Iyer",
      "budget": 5500,
      "image": "userimage/woman2.jpg",
      "about": "Priya Iyer is a 35-year-old research scientist from Chennai with a focus on environmental science. She is deeply passionate about climate change and sustainability, dedicating her career to finding ways to reduce environmental impact. Priya works closely with NGOs and government bodies to promote sustainable living practices. Outside of work, she enjoys gardening and experimenting with eco-friendly products. Priya is also an avid traveler, often visiting remote locations to observe biodiversity and local ecosystems. She believes that small, consistent efforts can lead to a greener future for the planet.",
      "habits": ["Gardening", "Traveling", "Eco-friendly Living"],
      "age": 35,
      "occupation": "Research Scientist",
      "place": "Chennai",
      "contact_no": "9876-123-456",
      "email": "priya.iyer@example.com",
      "instagram": "priya_green",
      "linkedin": "priya-iyer",
      "gender": "Female",
      "preferred_gender": "male"
    },
    {
      "id": 5,
      "name": "Vikram Singh",
      "budget": 6000,
      "image": "userimage/man3.jpg",
      "about": "Vikram Singh is a 40-year-old entrepreneur from Jaipur who runs a successful textile business. Coming from a family with a long tradition in textiles, Vikram took over the family business 10 years ago and expanded it internationally. He is a firm believer in the power of innovation and modern technology in traditional industries. Outside of work, Vikram enjoys mentoring young entrepreneurs and frequently gives talks at business schools. He is also an avid horse rider and enjoys participating in polo matches. Vikram is a family man who loves spending time with his wife and two children.",
      "habits": ["Horse Riding", "Mentoring", "Traveling"],
      "age": 40,
      "occupation": "Entrepreneur",
      "place": "Jaipur",
      "contact_no": "9823-456-789",
      "email": "vikram.singh@example.com",
      "instagram": "vikram_sportsman",
      "linkedin": "vikram-singh",
      "gender": "Male",
      "preferred_gender": "female"
    },
    {
      "id": 6,
      "name": "Anjali Menon",
      "budget": 2500,
      "image": "userimage/woman3.jpg",
      "about": "Anjali Menon is a 24-year-old content creator from Kochi who specializes in lifestyle and fashion blogging. Her social media accounts are filled with tips on sustainable fashion, beauty, and everyday hacks. Anjali started her journey as a blogger during her college days and has grown a large following over the past few years. Besides her love for fashion, Anjali is also a trained classical dancer and practices Bharatanatyam regularly. She often incorporates elements of traditional Indian culture into her content. Anjali enjoys connecting with her audience and sharing her experiences with them.",
      "habits": ["Fashion Blogging", "Classical Dance", "Traveling"],
      "age": 24,
      "occupation": "Content Creator",
      "place": "Kochi",
      "contact_no": "9874-321-654",
      "email": "anjali.menon@example.com",
      "instagram": "anjali_style",
      "linkedin": "anjali-menon",
      "gender": "Female",
      "preferred_gender": "male"
    },
    {
      "id": 7,
      "name": "Rajesh Patel",
      "budget": 3500,
      "image": "userimage/man4.jpg",
      "about": "Rajesh Patel, 31, is a mechanical engineer from Ahmedabad with a love for innovation and technology. He works in the automobile industry, designing energy-efficient vehicles. Rajesh is a problem solver at heart and loves tinkering with machines and gadgets in his free time. His passion for innovation has led him to file several patents related to sustainable vehicle design. When he’s not working, Rajesh enjoys cycling and participating in long-distance rides with his friends. He also has a deep interest in astronomy and often spends nights stargazing with his telescope.",
      "habits": ["Cycling", "Stargazing", "Innovation"],
      "age": 31,
      "occupation": "Mechanical Engineer",
      "place": "Ahmedabad",
      "contact_no": "9845-432-123",
      "email": "rajesh.patel@example.com",
      "instagram": "rajesh_engineer",
      "linkedin": "rajesh-patel",
      "gender": "Male",
      "preferred_gender": "female"
    },
    {
      "id": 8,
      "name": "Shreya Gupta",
      "budget": 4200,
      "image": "userimage/woman4.jpg",
      "about": "Shreya Gupta is a 26-year-old graphic designer from Pune who works with various brands to create impactful visual identities. Shreya has a deep love for colors and creativity, which is reflected in her work. She enjoys helping businesses convey their message through design and branding. In her spare time, Shreya likes to paint and explore different artistic styles. She also practices photography and enjoys capturing nature and street scenes. Shreya is known for her attention to detail and believes that design has the power to transform perceptions. She dreams of one day holding her own art exhibition.",
      "habits": ["Painting", "Photography", "Design"],
      "age": 26,
      "occupation": "Graphic Designer",
      "place": "Pune",
      "contact_no": "9873-987-654",
      "email": "shreya.gupta@example.com",
      "instagram": "shreya_creative",
      "linkedin": "shreya-gupta",
      "gender": "Female",
      "preferred_gender": "male"
    },
    {
      "id": 9,
      "name": "Siddharth Rao",
      "budget": 4800,
      "image": "userimage/man5.jpg",
      "about": "Siddharth Rao is a 38-year-old architect from Hyderabad with a strong focus on sustainable architecture. He is known for designing eco-friendly buildings that combine modern aesthetics with functionality. Siddharth has won multiple awards for his innovative designs and continues to push the boundaries of green architecture in India. Outside of work, Siddharth is a passionate wildlife photographer and frequently travels to national parks to capture India’s rich biodiversity. He also enjoys hiking and nature conservation. Siddharth believes in living a minimalist lifestyle and constantly works toward reducing his carbon footprint.",
      "habits": ["Photography", "Hiking", "Sustainable Living"],
      "age": 38,
      "occupation": "Architect",
      "place": "Hyderabad",
      "contact_no": "9874-654-321",
      "email": "siddharth.rao@example.com",
      "instagram": "siddharth_eco",
      "linkedin": "siddharth-rao",
      "gender": "Male",
      "preferred_gender": "female"
    },
    {
      "id": 10,
      "name": "Pooja Desai",
      "budget": 3900,
      "image": "userimage/woman5.jpg",
      "about": "Pooja Desai is a 29-year-old teacher from Surat who has a deep passion for education and child development. She works at a local school where she teaches primary-level students. Pooja believes in interactive learning methods and often integrates arts and crafts into her lessons to make learning more fun. Outside of her teaching career, Pooja enjoys dancing and is trained in classical Indian dance forms like Kathak. She regularly participates in cultural events and believes that dance helps her connect with her cultural roots. Pooja also loves to bake and often makes desserts for family and friends.",
      "habits": ["Teaching", "Dancing", "Baking"],
      "age": 29,
      "occupation": "Teacher",
      "place": "Surat",
      "contact_no": "9842-321-654",
      "email": "pooja.desai@example.com",
      "instagram": "pooja_teaches",
      "linkedin": "pooja-desai",
      "gender": "Female",
      "preferred_gender": "male"
    }
  ]
  